# CanHaveTypeAssigned Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..CanHaveTypeAssigned Method
Subelement Class See Also
---
Identifies if the subelement can have a type assigned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CanHaveTypeAssigned()
```

Visual Basic
---
```text
Public Function CanHaveTypeAssigned As Boolean
```

Visual C++
---
```text
public:
bool CanHaveTypeAssigned()
```

# ### Return Value
True if subelement can have a type assigned, false otherwise.
# Remarks
Some subelements cannot have type assigned, in which case invalid element id is considered to be their type id.
# See Also
Subelement Class
Autodesk.Revit.DB Namespace